// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");
//Задайте массив заполненный случайными положительными трёхзначными числами.
// Напишите программу, которая покажет количество чётных чисел в массиве.

//[345, 897, 568, 234] -> 2


